Kozurofu-San/kozurofu-utils/svd/PIC32MX440F256H.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CMP</name>
      <description>CMP peripheral</description>
      <baseAddress>0xbf80a060</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CMSTAT</name>
          <description>CMSTAT register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>C1OUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C2OUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSTATCLR</name>
          <description>CMSTATCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>C1OUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C2OUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSTATSET</name>
          <description>CMSTATSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>C1OUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C2OUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSTATINV</name>
          <description>CMSTATINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>C1OUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C2OUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>OSC</name>
      <description>OSC peripheral</description>
      <baseAddress>0xbf80f000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OSCCON</name>
          <description>OSCCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>7</resetValue>
          <fields>
            <field>
              <name>OSWEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SOSCEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UFRCEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SLPEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ULOCK</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CLKLOCK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NOSC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>COSC</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>PLLMULT</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PBDIV</name>
              <bitRange>[20:19]</bitRange>
            </field>
            <field>
              <name>SOSCRDY</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>FRCDIV</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>PLLODIV</name>
              <bitRange>[29:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCONCLR</name>
          <description>OSCCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OSWEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SOSCEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UFRCEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SLPEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ULOCK</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CLKLOCK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NOSC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>COSC</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>PLLMULT</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PBDIV</name>
              <bitRange>[20:19]</bitRange>
            </field>
            <field>
              <name>SOSCRDY</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>FRCDIV</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>PLLODIV</name>
              <bitRange>[29:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCONSET</name>
          <description>OSCCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OSWEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SOSCEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UFRCEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SLPEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ULOCK</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CLKLOCK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NOSC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>COSC</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>PLLMULT</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PBDIV</name>
              <bitRange>[20:19]</bitRange>
            </field>
            <field>
              <name>SOSCRDY</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>FRCDIV</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>PLLODIV</name>
              <bitRange>[29:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCONINV</name>
          <description>OSCCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OSWEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SOSCEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UFRCEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SLPEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ULOCK</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CLKLOCK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NOSC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>COSC</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>PLLMULT</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PBDIV</name>
              <bitRange>[20:19]</bitRange>
            </field>
            <field>
              <name>SOSCRDY</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>FRCDIV</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>PLLODIV</name>
              <bitRange>[29:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCTUN</name>
          <description>OSCTUN register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TUN</name>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCTUNCLR</name>
          <description>OSCTUNCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TUN</name>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCTUNSET</name>
          <description>OSCTUNSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TUN</name>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCTUNINV</name>
          <description>OSCTUNINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TUN</name>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
