Kozurofu-San/kozurofu-utils/svd/PIC32MX440F256H.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RCON</name>
      <description>RCON peripheral</description>
      <baseAddress>0xbf80f600</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RCON</name>
          <description>RCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>3</resetValue>
          <fields>
            <field>
              <name>POR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BOR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IDLE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SLEEP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>WDTO</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SWR</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EXTR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>VREGS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CMR</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCONCLR</name>
          <description>RCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>POR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BOR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IDLE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SLEEP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>WDTO</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SWR</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EXTR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>VREGS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CMR</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCONSET</name>
          <description>RCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>POR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BOR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IDLE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SLEEP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>WDTO</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SWR</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EXTR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>VREGS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CMR</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCONINV</name>
          <description>RCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>POR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BOR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IDLE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SLEEP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>WDTO</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SWR</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EXTR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>VREGS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CMR</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RSWRST</name>
          <description>RSWRST register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SWRST</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RSWRSTCLR</name>
          <description>RSWRSTCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SWRST</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RSWRSTSET</name>
          <description>RSWRSTSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SWRST</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RSWRSTINV</name>
          <description>RSWRSTINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SWRST</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
