Kozurofu-San/kozurofu-utils/svd/PIC32MX440F256H.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>_DDPSTAT</name>
      <description>_DDPSTAT peripheral</description>
      <baseAddress>0xbf880140</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>_DDPSTAT</name>
          <description>_DDPSTAT register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>APIFUL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>APOFUL</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>STRFUL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>APIOV</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>APOOV</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>STOV</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>_STRO</name>
      <description>_STRO peripheral</description>
      <baseAddress>0xbf880170</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>_STRO</name>
          <description>_STRO register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>_STRO</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_STROCLR</name>
          <description>_STROCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>_STRO</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_STROSET</name>
          <description>_STROSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>_STRO</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_STROINV</name>
          <description>_STROINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>_STRO</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>_APPO</name>
      <description>_APPO peripheral</description>
      <baseAddress>0xbf880180</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>_APPO</name>
          <description>_APPO register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>_APPO</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_APPOCLR</name>
          <description>_APPOCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>_APPO</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_APPOSET</name>
          <description>_APPOSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>_APPO</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_APPOINV</name>
          <description>_APPOINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>_APPO</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>_APPI</name>
      <description>_APPI peripheral</description>
      <baseAddress>0xbf880190</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>_APPI</name>
          <description>_APPI register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>_APPI</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>INT</name>
      <description>INT peripheral</description>
      <baseAddress>0xbf881000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x150</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>INTCON</name>
          <description>INTCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INT0EP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INT1EP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INT2EP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT3EP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>INT4EP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TPC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>MVEC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SS0</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCONCLR</name>
          <description>INTCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INT0EP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INT1EP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INT2EP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT3EP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>INT4EP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TPC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>MVEC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SS0</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCONSET</name>
          <description>INTCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INT0EP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INT1EP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INT2EP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT3EP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>INT4EP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TPC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>MVEC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SS0</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCONINV</name>
          <description>INTCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INT0EP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INT1EP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INT2EP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT3EP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>INT4EP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TPC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>MVEC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SS0</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>INTSTAT register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VEC</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>RIPL</name>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTMR</name>
          <description>IPTMR register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IPTMR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTMRCLR</name>
          <description>IPTMRCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IPTMR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTMRSET</name>
          <description>IPTMRSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IPTMR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTMRINV</name>
          <description>IPTMRINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IPTMR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS0</name>
          <description>IFS0 register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OC1IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>INT1IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T2IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OC2IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>INT2IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>T3IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OC3IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>INT3IF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>T4IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>OC4IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>INT4IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>T5IF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC5IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC5IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>U1EIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>U1RXIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>U1TXIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>I2C1BIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>I2C1SIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>I2C1MIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS0CLR</name>
          <description>IFS0CLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OC1IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>INT1IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T2IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OC2IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>INT2IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>T3IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OC3IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>INT3IF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>T4IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>OC4IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>INT4IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>T5IF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC5IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC5IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>U1EIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>U1RXIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>U1TXIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>I2C1BIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>I2C1SIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>I2C1MIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
