Kozurofu-San/kozurofu-utils/svd/PIC32MX440F256H.svd
        <register>
          <name>U1SOFCLR</name>
          <description>U1SOFCLR register</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1SOFSET</name>
          <description>U1SOFSET register</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1SOFINV</name>
          <description>U1SOFINV register</description>
          <addressOffset>0x27c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP2</name>
          <description>U1BDTP2 register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRH</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP2CLR</name>
          <description>U1BDTP2CLR register</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRH</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP2SET</name>
          <description>U1BDTP2SET register</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRH</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP2INV</name>
          <description>U1BDTP2INV register</description>
          <addressOffset>0x28c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRH</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP3</name>
          <description>U1BDTP3 register</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRU</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP3CLR</name>
          <description>U1BDTP3CLR register</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRU</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP3SET</name>
          <description>U1BDTP3SET register</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRU</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP3INV</name>
          <description>U1BDTP3INV register</description>
          <addressOffset>0x29c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRU</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1CNFG1</name>
          <description>U1CNFG1 register</description>
          <addressOffset>0x2a0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBSIDL</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USBFRZ</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>UOEMON</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UTEYE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1CNFG1CLR</name>
          <description>U1CNFG1CLR register</description>
          <addressOffset>0x2a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBSIDL</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USBFRZ</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>UOEMON</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UTEYE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1CNFG1SET</name>
          <description>U1CNFG1SET register</description>
          <addressOffset>0x2a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBSIDL</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USBFRZ</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>UOEMON</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UTEYE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1CNFG1INV</name>
          <description>U1CNFG1INV register</description>
          <addressOffset>0x2ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBSIDL</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USBFRZ</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>UOEMON</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UTEYE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP0</name>
          <description>U1EP0 register</description>
          <addressOffset>0x2c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RETRYDIS</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LSPD</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP0CLR</name>
          <description>U1EP0CLR register</description>
          <addressOffset>0x2c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RETRYDIS</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LSPD</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP0SET</name>
          <description>U1EP0SET register</description>
          <addressOffset>0x2c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RETRYDIS</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LSPD</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP0INV</name>
          <description>U1EP0INV register</description>
          <addressOffset>0x2cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RETRYDIS</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LSPD</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP1</name>
          <description>U1EP1 register</description>
          <addressOffset>0x2d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP1CLR</name>
          <description>U1EP1CLR register</description>
          <addressOffset>0x2d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP1SET</name>
          <description>U1EP1SET register</description>
          <addressOffset>0x2d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP1INV</name>
          <description>U1EP1INV register</description>
          <addressOffset>0x2dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP2</name>
          <description>U1EP2 register</description>
          <addressOffset>0x2e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP2CLR</name>
          <description>U1EP2CLR register</description>
          <addressOffset>0x2e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP2SET</name>
          <description>U1EP2SET register</description>
          <addressOffset>0x2e8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP2INV</name>
          <description>U1EP2INV register</description>
          <addressOffset>0x2ec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP3</name>
          <description>U1EP3 register</description>
          <addressOffset>0x2f0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP3CLR</name>
          <description>U1EP3CLR register</description>
          <addressOffset>0x2f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP3SET</name>
          <description>U1EP3SET register</description>
          <addressOffset>0x2f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP3INV</name>
          <description>U1EP3INV register</description>
          <addressOffset>0x2fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP4</name>
          <description>U1EP4 register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP4CLR</name>
          <description>U1EP4CLR register</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
