Kozurofu-San/kozurofu-utils/svd/PIC32MX440F256H.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTD</name>
      <description>PORTD peripheral</description>
      <baseAddress>0xbf8860c0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TRISD</name>
          <description>TRISD register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>4095</resetValue>
          <fields>
            <field>
              <name>TRISD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRISD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISDCLR</name>
          <description>TRISDCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRISD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISDSET</name>
          <description>TRISDSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRISD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISDINV</name>
          <description>TRISDINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRISD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTD</name>
          <description>PORTD register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTDCLR</name>
          <description>PORTDCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTDSET</name>
          <description>PORTDSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTDINV</name>
          <description>PORTDINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATD</name>
          <description>LATD register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATDCLR</name>
          <description>LATDCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATDSET</name>
          <description>LATDSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATDINV</name>
          <description>LATDINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCD</name>
          <description>ODCD register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCDCLR</name>
          <description>ODCDCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
