Kozurofu-San/kozurofu-utils/svd/PIC32MX440F256H.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTG</name>
      <description>PORTG peripheral</description>
      <baseAddress>0xbf886180</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x70</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TRISG</name>
          <description>TRISG register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>972</resetValue>
          <fields>
            <field>
              <name>TRISG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISGCLR</name>
          <description>TRISGCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISGSET</name>
          <description>TRISGSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISGINV</name>
          <description>TRISGINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTG</name>
          <description>PORTG register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTGCLR</name>
          <description>PORTGCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTGSET</name>
          <description>PORTGSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTGINV</name>
          <description>PORTGINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATG</name>
          <description>LATG register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATGCLR</name>
          <description>LATGCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATGSET</name>
          <description>LATGSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATGINV</name>
          <description>LATGINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCG</name>
          <description>ODCG register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCGCLR</name>
          <description>ODCGCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCGSET</name>
          <description>ODCGSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCGINV</name>
          <description>ODCGINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCON</name>
          <description>CNCON register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONCLR</name>
          <description>CNCONCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONSET</name>
          <description>CNCONSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONINV</name>
          <description>CNCONINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNEN</name>
          <description>CNEN register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNEN0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNEN1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNEN2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNEN3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNEN4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNEN5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNEN6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNEN7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNEN8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNEN9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNEN10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNEN11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNEN12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNEN13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNEN14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNEN15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CNEN16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CNEN17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CNEN18</name>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENCLR</name>
          <description>CNENCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNEN0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNEN1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNEN2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNEN3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNEN4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNEN5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNEN6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNEN7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNEN8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNEN9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNEN10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNEN11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNEN12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNEN13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNEN14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNEN15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CNEN16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CNEN17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CNEN18</name>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
