Kozurofu-San/kozurofu-utils/svd/PIC32MX440F256H.svd
        <register>
          <name>CNENSET</name>
          <description>CNENSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNEN0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNEN1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNEN2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNEN3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNEN4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNEN5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNEN6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNEN7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNEN8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNEN9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNEN10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNEN11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNEN12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNEN13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNEN14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNEN15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CNEN16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CNEN17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CNEN18</name>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENINV</name>
          <description>CNENINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNEN0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNEN1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNEN2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNEN3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNEN4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNEN5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNEN6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNEN7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNEN8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNEN9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNEN10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNEN11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNEN12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNEN13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNEN14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNEN15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CNEN16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CNEN17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CNEN18</name>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUE</name>
          <description>CNPUE register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUE10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUE11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUE12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUE13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUE14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUE15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CNPUE16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CNPUE17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CNPUE18</name>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUECLR</name>
          <description>CNPUECLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUE10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUE11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUE12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUE13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUE14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUE15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CNPUE16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CNPUE17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CNPUE18</name>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUESET</name>
          <description>CNPUESET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUE10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUE11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUE12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUE13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUE14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUE15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CNPUE16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CNPUE17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CNPUE18</name>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUEINV</name>
          <description>CNPUEINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUE10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUE11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUE12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUE13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUE14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUE15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CNPUE16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CNPUE17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CNPUE18</name>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>